app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES(NULL, '2011-01-27 20:00:51', '2011-01-27 20:00:51')
---
  def create
    @category = Category.new(params[:category])
    if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 4)
UPDATE "categories" SET "updated_at" = '2011-01-27 20:37:41', "name" = 'Wedding1' WHERE "id" = 2
---
  def update
    @category = Category.find(params[:id])
    @category.update_attributes(params[:category])

SELECT * FROM "categories" WHERE ("categories"."id" = 3)
SELECT "photos".id FROM "photos" WHERE ("photos".category_id = 2) LIMIT 1
DELETE FROM "categories" WHERE "id" = 3
---
  def destroy
    @category = Category.find(params[:id])
    if @category.photos.exists?
      return redirect_to bulk_edit_admin_photos_path(:category_id => @category.id, :to_destroy => :true)
    else
      @category.destroy