app/controllers/admin/photos_controller.rb

  def new
    @photo = Photo.new
    @category_id = params[:category_id]
    if @category_id
      @category = Category.find(@category_id)
---
SELECT * FROM "categories" WHERE ("categories"."id" = 2)

  def create
    @photo = Photo.new(params[:photo])
    if @photo.save
---
INSERT INTO "photos" ("name", "position", "created_at", "updated_at", "picture_content_type", "picture_updated_at", "category_id", "picture_file_name", "picture_file_size", "description") VALUES(NULL, NULL, '2011-01-27 21:55:30', '2011-01-27 21:55:30', NULL, NULL, NULL, NULL, NULL, NULL)

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 13) ORDER BY photos.position ASC

  def update
    @photo = Photo.find(params[:id])
    if @photo.update_attributes(params[:photo])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 13) ORDER BY photos.position ASC
UPDATE "photos" SET "updated_at" = '2011-01-27 22:42:53', "picture_file_size" = 16225, "picture_file_name" = 'this-side-up-asshole.png', "picture_updated_at" = '2011-01-27 22:42:53' WHERE "id" = 5

  def bulk_edit
    @category = Category.find(params[:category_id])
    @destroy_category = params.fetch(:to_destroy, false)
    @other_categories = Category.all - [@category]
---
SELECT * FROM "categories" WHERE ("categories"."id" = 2)
SELECT * FROM "categories"

  def bulk_update
    @category = Category.find(params[:category_id])
    case
      when params[:move_to] && @destination_category_id = params[:move_to].fetch(:category_id, false)
        @category.photos.update_all(:category_id => @destination_category_id)
      when params.fetch(:destroy_all, false)
        @category.photos.destroy_all
---
SELECT * FROM "categories" WHERE ("categories"."id" = 2)
UPDATE "photos" SET "category_id" = '4' WHERE ("photos".category_id = 2)
DELETE FROM "categories" WHERE "id" = 4
DELETE FROM "photos" WHERE "id" = 4

  def destroy
    @photo = Photo.find(params[:id])
    @category_id = @photo.category_id
    @photo.destroy
---
SELECT * FROM "photos" WHERE ("photos"."id" = 5)
DELETE FROM "photos" WHERE "id" = 5