app/controllers/photos_controller.rb

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 12) ORDER BY photos.position ASC